# include <stdio.h>
# include "functions.h"

int main() {
    printf(" Числа: 10, 20, 30, 40, 50.\n");
    printf(" Сумма: %.2f\n", sum(5, 10.0, 20.0, 30.0, 40.0, 50.0));
    printf(" Максимум: %.2f\n", max(5,10.0,20.0,30.0,40.0,50.0));
    printf(" Минимум: %.2f\n", min(5,10.0,20.0,30.0,40.0,50.0));
    printf(" Среднее: %.2f\n", average(5,10.0,20.0,30.0,40.0,50.0));

    printf(" Числа: 1.5,2.5,3.5\n");
    printf(" Сумма: %.2f\n", sum(3, 1.5, 2.5, 3.5));
    printf(" Максимум: %.2f\n", max(3, 1.5, 2.5, 3.5));
    printf(" Минимум: %.2f\n", min(3, 1.5, 2.5, 3.5));
    printf(" Среднее: %.2f\n", average(3, 1.5, 2.5, 3.5));
}